Revit 2027 API
RebarHandleNameData Methods
The RebarHandleNameData type exposes the following members.
Methods
Name | Description
Dispose
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetCustomHandleTag |  Gets the handle tag for which we need to specify the name.
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
SetCustomHandleName |  Sets the name of the handle.
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
RebarHandleNameData Class
Autodesk.Revit.DB.Structure Namespace